chayuto/ws-ESP32-S3-Touch-AMOLED-1.8/projects/05_dictation/sdkconfig.defaults
# 05_dictation - offline speech to text, printed on the glass.
# Board: Waveshare ESP32-S3-Touch-AMOLED-1.8 (ESP32-S3R8, 16 MB quad flash, 8 MB OPI PSRAM)
#
# Language is NOT set here. Add sdkconfig.en or sdkconfig.cn to SDKCONFIG_DEFAULTS -
# that is the whole difference between the two builds, and the reason this is one
# project and not two. See docs/design/05_dictation.md.

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Full 240 MHz. ESP-IDF otherwise boots the S3 at 160 MHz.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# 8 MB app partition from day one. 02 finished at 7% free in 4 MB.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Text is the entire UI here, so the font ladder matters more than it did in 02.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# ESP-SR. No WakeNet model on purpose - the AFE is created with wakenet_init = false.
CONFIG_MODEL_IN_FLASH=y
# Neural VAD (288 KB). The WebRTC one called a quiet room speech; this is also what
# gates the recogniser, which on this project is a power requirement, not a filter.
CONFIG_SR_VADN_VADNET1_MEDIUM=y
# No neural NS: nsnet2 in the SR pipeline flattened speech to noise for MultiNet in 02.
CONFIG_SR_NSN_WEBRTC=y

# Dictionary and font files on the card are named in full; FAT 8.3 cannot hold that.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Internal RAM is the ceiling (02 measured 72 KB free with MultiNet loaded).
# Wi-Fi only runs in maintenance mode here, but when it does it must fit.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_TCP_WND_DEFAULT=5760
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5760
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Logging, agentic first. DEBUG compiled in, INFO default, own tags raised at boot.
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=n
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_DICT_NTP=y
